---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.DeleteElementsWarn
source: html/973e87d4-ee4e-c023-9a58-d2d95eb0070a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.DeleteElementsWarn Property

[Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId DeleteElementsWarn { get; }
```